In [1]:
%matplotlib inline
import pandas as pd
import numpy as np

In [2]:
# from IPython.core.display import HTML
# css = open('style-table.css').read() + open('style-notebook.css').read()
# HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('C:/Users/admin/Downloads/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
casts = pd.read_csv('C:/Users/admin/Downloads/cast.csv')
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
release_dates = pd.read_csv('C:/Users/admin/Downloads/release_dates.csv')
release_dates.head(6)

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21
5                 #Horror  2015          USA  2015-11-20

### How many movies are listed in the titles dataframe?

In [6]:
print('Total movies listed in the titles dataframe are:',titles.shape[0])

Total movies listed in the titles dataframe are: 244914

In [7]:
titles.count()

title    244914
year     244914
dtype: int64

### What are the earliest two films listed in the titles dataframe?

In [8]:
top_mov = titles.title[:2]

In [9]:
print('Earliest two films listed in the titles dataframe are:', list(top_mov))

Earliest two films listed in the titles dataframe are: ['Tasveer Mere Sanam', 'Only You']

### How many movies have the title "Hamlet"?

In [10]:
hamlet_mov_count = titles.loc[(titles.title == 'Hamlet')]

In [11]:
print('Total movies have the title "Hamlet":', hamlet_mov_count.title.count())

Total movies have the title "Hamlet": 20

### How many movies are titled "North by Northwest"?

In [12]:
n_mov = titles.loc[(titles.title == 'North by Northwest')].shape[0]

In [13]:
print('No. of movies are titled "North by Northwest"', n_mov)

No. of movies are titled "North by Northwest" 1

### When was the first movie titled "Hamlet" made?

In [14]:
ham_first_movie_year = titles.loc[(titles.title == 'Hamlet')].sort_values(by='year')
year = ham_first_movie_year.year[:1].values
print('First movie titled "Hamlet" made in:',year[0])

First movie titled "Hamlet" made in: 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [15]:
tre_isl_mov = titles.loc[(titles.title == 'Treasure Island')].sort_values(by='year')
list_tre_isl_mov = list(tre_isl_mov.values)
print('List of all the "Treasure Island" movies from earliest to most recent:',list_tre_isl_mov)
tre_isl_mov

List of all the "Treasure Island" movies from earliest to most recent: [array(['Treasure Island', 1918], dtype=object), array(['Treasure Island', 1920], dtype=object), array(['Treasure Island', 1934], dtype=object), array(['Treasure Island', 1950], dtype=object), array(['Treasure Island', 1972], dtype=object), array(['Treasure Island', 1973], dtype=object), array(['Treasure Island', 1985], dtype=object), array(['Treasure Island', 1999], dtype=object)]

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [16]:
mov_in_1950 = titles.loc[(titles.year == 1950)]
print('Total movies were made in the year 1950:',mov_in_1950.title.count())

Total movies were made in the year 1950: 1113

### How many movies were made in the year 1960?

In [17]:
mov_in_1960 = titles.loc[(titles.year == 1960)]
print('Total movies were made in the year 1960:',mov_in_1960.title.shape[0])

Total movies were made in the year 1960: 1549

### How many movies were made from 1950 through 1959?

In [18]:
mov_1950to1959 = titles.loc[(titles.year >= 1950) & (titles.year <= 1959)].title.count()
print('Number of movies were made from 1950 through 1959:', mov_1950to1959)

Number of movies were made from 1950 through 1959: 12934

### In what years has a movie titled "Batman" been released?

In [19]:
batman_mov = titles.loc[(titles.title == 'Batman')]
print('"Batman" movie is released in:', batman_mov.year.values[0], 'and', batman_mov.year.values[1] )

"Batman" movie is released in: 1943 and 1989

### How many roles were there in the movie "Inception"?

In [20]:
incep_mov = casts.loc[(casts.title == 'Inception')]
n_roles = incep_mov.name.value_counts().sum()

In [21]:
print('No. of roles were there in the movie "Inception"', n_roles)

No. of roles were there in the movie "Inception" 78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [22]:
incep_mov = casts.loc[(casts.title == 'Inception')]
not_n_value = incep_mov.n.isna().sum()

In [23]:
print('No. of roles in the movie "Inception" are NOT ranked by an "n" value:', not_n_value)

No. of roles in the movie "Inception" are NOT ranked by an "n" value: 27

### But how many roles in the movie "Inception" did receive an "n" value?

In [24]:
incep_mov = casts.loc[(casts.title == 'Inception')]
n_values = incep_mov.n.isna().sum()

In [25]:
print('No. of roles in the movie "Inception" are ranked by an "n" value:', n_values)

No. of roles in the movie "Inception" are ranked by an "n" value: 27

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [26]:
noth_by_northwest_casts = casts.loc[(casts.title == 'North by Northwest') & (casts.n.isna() == False )]
noth_by_northwest_casts.head(3)

                     title  year             name   type       character     n
206471  North by Northwest  1959     Edward Binns  actor  Captain Junket  15.0
356707  North by Northwest  1959   Leo G. Carroll  actor   The Professor   5.0
464736  North by Northwest  1959  Philip Coolidge  actor       Dr. Cross  13.0

In [27]:
print(
    'Cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value:', noth_by_northwest_casts.name
     )

Cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value: 206471             Edward Binns
356707           Leo G. Carroll
464736          Philip Coolidge
665768        Robert Ellenstein
871426               Cary Grant
1275337           Martin Landau
1384780               Ken Lynch
1457165             James Mason
1508344           Patrick McVey
1695173             Philip Ober
1811387            Edward Platt
2295714            Les Tremayne
2447081           Adam Williams
3048272    Josephine Hutchinson
3157232     Jessie Royce Landis
3518333         Eva Marie Saint
Name: name, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [28]:
sleuth_mov_1972 = casts.loc[(casts.title == "Sleuth") & (casts.year == 1972)].sort_values(by= 'n')

In [29]:
print('Entire cast, in "n"-order, of the 1972 film "Sleuth":')
sleuth_mov_1972

Entire cast, in "n"-order, of the 1972 film "Sleuth":

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [30]:
sleuth_mov_2007 = casts.loc[(casts.title == "Sleuth") & (casts.year == 2007)].sort_values(by= 'n')

In [31]:
print('The entire cast, in "n"-order, of the 2007 version of "Sleuth":')
sleuth_mov_2007

The entire cast, in "n"-order, of the 2007 version of "Sleuth":

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [32]:
n_hamlet = casts.loc[(casts.character == 'Hamlet') & (casts.year == 1921)]
n_hamlet

          title  year          name     type character    n
3355176  Hamlet  1921  Asta Nielsen  actress    Hamlet  1.0

In [33]:
print('No. of roles were credited in silent 1921 vaersioni of hamlet:', n_hamlet.shape[0])

No. of roles were credited in silent 1921 vaersioni of hamlet: 1

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [34]:
n_hamlet_96 = casts.loc[(casts.character == 'Hamlet') & (casts.year == 1996)]
n_hamlet_96

         title  year             name   type character    n
260225  Hamlet  1996  Kenneth Branagh  actor    Hamlet  5.0

In [35]:
print('Number of roles were credited in Branagh\'s 1996 Hamlet', n_hamlet_96.shape[0])

Number of roles were credited in Branagh's 1996 Hamlet 1

### How many "Hamlet" roles have been listed in all film credits through history?

In [36]:
n_hamlet_hist = casts.loc[(casts.character == 'Hamlet') ]

In [37]:
print('Number of "Hamlet" roles have been listed in all film credits through history:',n_hamlet_hist.shape[0] )

Number of "Hamlet" roles have been listed in all film credits through history: 96

### How many people have played an "Ophelia"?

In [38]:
ophelia_char = casts.loc[(casts.character == 'Ophelia')].name.nunique()

In [39]:
print('Number of peoples have played an "Ophelia":', ophelia_char)

Number of peoples have played an "Ophelia": 115

### How many people have played a role called "The Dude"?

In [40]:
thedude_char = casts.loc[(casts.character == 'The Dude')].name.nunique()

In [41]:
print('Number of people have played a role called "The Dude":', thedude_char)

Number of people have played a role called "The Dude": 19

### How many people have played a role called "The Stranger"?

In [42]:
thestranger_char = casts.loc[(casts.character == 'The Stranger')].name.nunique()

In [43]:
print('Numbers of people have played a role called "The Stranger":', thestranger_char)

Numbers of people have played a role called "The Stranger": 202

### How many roles has Sidney Poitier played throughout his career?

In [44]:
Sidneypoitier = casts.loc[(casts.name == 'Sidney Poitier')].character.nunique()

In [45]:
print('Number of roles has Sidney Poitier played throughout his carrer:', Sidneypoitier)

Number of roles has Sidney Poitier played throughout his carrer: 41

### How many roles has Judi Dench played?

In [46]:
judidench = casts.loc[(casts.name == 'Judi Dench')].character.nunique()

In [47]:
print('Number of roles has Judi Dench played:', judidench)

Number of roles has Judi Dench played: 46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [48]:
carygrant_sup_role = casts.loc[(casts.name == 'Cary Grant') & (casts.n == 2) & (casts.year >= 1940)].sort_values(by = 'year')
carygrant_sup_role

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

In [49]:
print('List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year:', list(carygrant_sup_role.character))

List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year: ['Nick Arden', 'Roger Adams']

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [50]:
carygrant_led_role = casts.loc[(casts.name == 'Cary Grant')  & (casts.year >= 1940)].sort_values(by = 'year')
carygrant_led_role.head(4)

,title,year,name,type,character,n
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0

In [51]:
print('List the leading roles played by Cary Grant in the 1940s, in order by year:', list(carygrant_led_role.character))

List the leading roles played by Cary Grant in the 1940s, in order by year: ['Nick Arden', 'Walter Burns', 'C. K. Dexter Haven', 'Matt Howard', 'Johnnie Aysgarth', 'Roger Adams', "Patrick 'Pat' O'Toole", 'Leopold Dilg', 'Joe Adams -posing as Joe Bascopolous', 'Capt. Cassidy', 'Mortimer Brewster', 'Jerry Flynn', 'Ernie Mott', 'Cary Grant', 'Cole Porter', 'Cary Grant', 'Devlin', 'Dick Nugent', 'Dudley', 'Dr. Madison Brown', 'Jim Blandings', 'Captain Henri Rochard', 'Dr. Eugene Norland Ferguson', 'Dr. Noah Praetorius', 'Dr. Barnaby Fulton', 'George Rose', 'Clemson Reade', 'John Robie', 'Anthony', 'Nickie Ferrante', 'Cmdr. Andy Crewson', 'Philip Adams', 'Tom Winters', 'Lt. Cmdr. Matt T. Sherman', 'Roger O. Thornhill', 'Victor Rhyall, Earl', 'Philip Shayne', 'Peter Joshua', 'Walter', 'Sir William Rutland', 'Himself', "'Handsome' (in 'Suspicion')", 'Walter Burns', 'Himself']

### How many roles were available for actors in the 1950s?

In [52]:
actor_roles_in_1950s = casts.loc[(casts.year <= 1950) & (casts.type == 'actor')].character.nunique()

In [53]:
print('Number of roles were available for actors in the 1950s:', actor_roles_in_1950s)

Number of roles were available for actors in the 1950s: 219107

### How many roles were available for actresses in the 1950s?

In [54]:
actress_roles_in_1950s = casts.loc[(casts.year <= 1950) & (casts.type == 'actress')].character.nunique()

In [55]:
print('Number of roles were available for actress in the 1950s:', actress_roles_in_1950s)

Number of roles were available for actress in the 1950s: 86325

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [56]:
led_role = casts.loc[(casts.n == 1) & (casts.year >= 1980)].character.nunique()

In [57]:
print('Number of leading roles were available through from the beginning of film history through 1980:', led_role)

Number of leading roles were available through from the beginning of film history through 1980: 57697

### How many non-leading roles were available through from the beginning of film history through 1980?

In [58]:
non_led_role = casts.loc[(casts.n.isna()== True) & (casts.year >= 1980)].character.nunique()

In [59]:
print('Number of non-leading roles were available through from the beginning of film history through 1980:', non_led_role)

Number of non-leading roles were available through from the beginning of film history through 1980: 439769

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [60]:
minor_role = casts.loc[(casts.year == 1980) & (casts.n.isna() == True)]

In [61]:
print('Number of roles through 1980 were minor enough that they did not warrant a numeric "n" rank:', minor_role.shape[0])

Number of roles through 1980 were minor enough that they did not warrant a numeric "n" rank: 4466